Repository: inrae/ALAMODE-okp
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/examples.po
Languages: fr

source: Examples of usage of the package ``okplm``
fr: Exemples d'utilisation du paquet ``okplm``

source: You can test the application with examples provided. The package contains four data examples in the folder ``examples``. An associated Python script (``test_script.py``) and a module based on the ``plotly`` package (``plotly_fonctions.py``) to plot results are available in the folder ``tests``.
fr: Vous pouvez tester l'application à l'aide des exemples de fichiers fournis. Le paquet contient quatre jeux de données d'exemple dans les dossier ``examples``: un exemple de script Python (``tests/test_script.py``), et un module basée sur le paquet ``plotly`` (``tests/plotly_fonctions.py``) et permettant de visualiser les résultats.

source: The data
fr: Les données

source: In all cases the lake data in the ``lake.txt`` file corresponds to the Lake Allos (lake code = ALL04). The meteorological data (``meteo.txt``) is synthetic data based on meteorological data. Air temperature has been created using a seasonal component and an ARMA model, while solar radiation data corresponds to the seasonal component only.
fr: Dans ces exemples, les données du lac dans le fichier ``lake.txt`` correspondent à celles du lac d'Allos. (code du lac = ALL04). Les données météorologiques (``meteo.txt``) sont des données synthétiques d'une base de données météorologiques. La température de l'air a été créée à l'aide d'une température avec une composante saisonnière et un modèle ARMA, tandis que les données de rayonnement solaire correspondent seulement à la composante saisonnière.

source: Three of the cases are used to exemplify the usage of ``okplm`` for three different periodicities. The necessary data for these tests can be found in the folders:
fr: Trois tests peuvent être réalisés avec ``test_script.py`` pour illustrer l’utilisation de ``okplm`` pour trois différentes fréquences. Les données nécessaires pour ces trois tests sont dans les dossiers :

source: synthetic_case_daily : daily data
fr: synthetic_case_daily : données journalières

source: synthetic_case_weekly: weekly data
fr: synthetic_case_weekly : données hebdomadaires

source: synthetic_case_monthly: monthly data
fr: synthetic_case_monthly : données mensuelles

source: The simulations
fr: Les simulations

source: For these three case the input is meteorological data (``meteo.txt``) and lake data (``lake.txt``). Thus, the model parameters are calculated from lake characteristics given in ``lake.txt`` with the following command:
fr: Pour ces trois cas, les données météorologiques (``meteo.txt``) et les données lacustres (``lake.txt``) sont fournies en entrée au modèle. Par conséquent, les paramètres du modèle sont calculés à partir des caractéristiques du lac dans ``lake.txt`` avec la formulation suivante :

source: In the case of the simulation with daily data, the script ``test_script.py`` gives example of validation of the model results with an observation data file ``obs.txt``.
fr: Dans le cas d'une simulation avec des données journalières, le script ``test_script.py`` donne un exemple de validation des résultats du modèle avec une fichier d'observation ``obs.txt``.

source: The remaining test case (synthetic_case_par_given) exemplifies the case when the parameter file is given. The data are in the folder:
fr: Le dernier cas de test (``synthetic_case_par_given``) est le cas où un fichier utilisateur des paramètres du modèle est donné en entrée. Les données sont dans le dossier :

source: examples/synthetic_case_given : daily data
fr: examples/synthetic_case_given : données journalières

source: The model uses the given parameter values (``par.txt``) and the daily meteorological data (``meteo.txt``). The file ``lake.txt`` is not necessary.
fr: Le modèle utilise donc les valeurs de paramètre (``par.txt``) et les données météorologiques journalières (``meteo.txt``). Le fichier ``lake.txt`` n'est pas nécessaire.

source: Plotting of results
fr: Visualisation des résultats

source: You can plot the simulation results with the function ``plotlyoutput()`` in the module ``tests/plotly_functions.py``, in addition to validation criteria (n, sd, r, me, mae et rmse) and observations, if they are available, with the instruction :
fr: La fonction ``plotlyoutput()`` dans le script ``plotly_functions.py`` permet de visualiser les résultats des simulations ainsi que, le cas échéant, les valeurs des critères de validation (n, sd, r, me, mae et rmse) et les observations avec la formulation suivante :

source: The results are then presented as an html file such as:
fr: Les résultats sont alors présentés sous la forme d'un fichier html de ce type :

source: Example of figure created by the function ``plotlyoutput()``
fr: Exemple de figure créée avec la fonction ``plotlyoutput()``
