Repository: inrae/ALAMODE-okp
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/installation.po
Languages: fr

source: Requirements and dependencies
fr: Besoins et dépendances

source: You need Python 3.5 or later to run the ``okplm`` package. You can have multiple Python versions (2.x and 3.x) installed on the same system without problems using, for example, virtual environments.
fr: Il est nécessaire d'avoir une version Python 3.5 ou ultérieure pour faire tourner le paquet ``okplm``. Il est possible d'avoir plusieurs versions de Python (2.x et 3.x) installées sur le même système d'exploitation en utilisant, par exemple, les environnements virtuels.

source: You may use ``pip`` to install the required packages.
fr: Vous pouvez utiliser ``pip`` pour installer les paquets requis.

source: In Windows, to use ``pip`` to install the required packages, please verify that the path to ``pip``'s executable file has been added correctly to your environment variable ``PATH``. The address may vary depending on whether you install it for one or all users (e.g., ``%USERPROFILE%\AppData\roaming\Python\Python37\scripts`` or ``C:\Users\MyUserName\AppData\Local\Programs\Python\Python37\Scripts``).
fr: Dans Windows, pour utiliser ``pip`` pour installer les paquets requis, veuillez vérifier que le chemin à l'exécutable de ``pip`` a été ajouté à la variable d'environnement ``PATH``. L'adresse peut varier selon le cas, si vous l'installez pour un ou tous les utilisateurs (e.g., ``%USERPROFILE%\AppData\roaming\Python\Python37\scripts`` ou ``C:\Users\MyUserName\AppData\Local\Programs\Python\Python37\Scripts``).

source: The application ``okplm`` depends on the Python package ``numpy``. Make sure it is installed before using ``okplm``.
fr: L'application ``okplm`` dépend du package Python ``numpy``. Assurez-vous qu'il est installé avant l'utilisation de ``okplm``.

source: If you do not have to compile the documentation, ``sphinx`` is not necessary to use ``okplm``, since a precompiled pdf copy of the documentation is included in the folder ``docs``.
fr: Si vous ne devez pas compiler la documentation, ``sphinx`` n'est pas nécessaire pour utiliser ``okplm``, puisque une copie déjà compilée de la documentation en pdf est incluse dans le dossier ``docs``.

source: If you need to compile the documentation from source (e.g., to modify it), you will need the package ``sphinx``. To install ``sphinx`` just make:
fr: Si vous avez besoin de compiler la documentation depuis le code source (p. ex., parce que vous avez fait des modifications), vous aurez besoin du paquet ``sphinx``. Pour installer ``sphinx`` simplement faites

source: The package ``sphinx`` works by default with reStructuredText documents. However, it can also recognise Markdown by installing the Markdown parser ``recommonmark``.
fr: Le paquet ``sphinx`` travaille par défaut avec documents de type reStructuredText. Mais il peut aussi reconnaître le formatage Markdown si on installe le parseur Markdown ``recommonmark``.

source: To create multilingual documentation, you will need the package ``sphinx-intl``. The installation process is as above:
fr: Pour créer documentation multilingue, vous avez besoin du paquet ``sphinx-intl``. Le procès d'installation est comme ci-dessus :

source: To compile pdf documents (only in Linux), you will also need to have installed latex and the Python package ``latexmk``. To install latex, type:
fr: Pour compiler documents pdf (seulement sous Linux), il vous faudra installer aussi latex et le paquet Python ``latexmk``. Pour installer latex, tapez :

source: And to install ``latexmk``, type:
fr: Et pour installer ``latexmk``, tapez :

source: Cloning the repository
fr: Clonage du référentiel

source: You need to clone the ``okplm`` package with git. For this go to an appropriate directory (e.g., ``pathtoprojectsfolder``) where to copy the project's code in a subfolder and clone the ``okplm`` project:
fr: Vous devez cloner le paquet ``okplm`` avec git. Pour ça, placez-vous dans un dossier approprié (e.g., ``pathtoprojrctsfolder``) où copier le code du projet et clonez le projet ``okplm`` :

source: This command creates the ``okplm`` repertory in the folder ``pathtoprojectsfolder``.
fr: Cette commande crée le répertoire ``okplm`` dans le dossier ``pathtoprojectsfolder``.

source: To install the development branch of the project, after cloning the ``okplm`` package, change to the ``dev`` branch:
fr: Pour installer la branche de développement du projet, après avoir cloné le paquet ``okplm``, passez à la branche ``dev``:

source: Installing ``okplm``
fr: Installation de ``okplm``

source: To install ``okplm``, go to the repertory created during the cloning of the package ``okplm`` (e.g., ``pathtorepertoryokplm``) and install it using ``pip``:
fr: Pour installer ``okplm``, allez dans le répertoire créé lors du clonage du paquet ``okplm (p. ex., ``pathtorepertoryokplm``) et installez-le en utilisant ``pip``:

source: Compilation of the project documentation
fr: Compilation de la documentation du projet

source: The source files for the project user manual are stored in the folder ``pathtorepertoryokplm/sphinx-doc/source``. Sphinx also extracts data from the project modules docstrings.
fr: Les fichiers source du manuel d'utilisation du projet sont stockés dans le dossier ``pathtorepertoryokplm/sphinx-doc/source``. Sphinx extrait aussi des données des docstrings des modules du projet.

source: Documentation in English
fr: Documentation en anglais

source: To compile the user manual in English as html files go to the folder ``pathtorepertoryokplm/sphinx-doc`` and type:
fr: Pour compiler le manuel d'utilisation en anglais en html allez au dossier ``pathtorepertoryokplm/sphinx-doc`` et tapez :

source: The output html files are saved in the folder ``pathtorepertoryokplm/sphinx-doc/build/html``
fr: Les fichiers html de sortie sont stockés dans le dossier ``pathtorepertoryokplm/sphinx-doc/build/html``.

source: You can also compile the user manual as a pdf file making:
fr: Vous pouvez compiler aussi le manuel d'utilisation en pdf avec :

source: The source documentation files are converted to latex and then to pdf. The output latex and pdf files are saved in the folder ``pathtorepertoryokplm/sphinx-doc/build/latex``.
fr: Les fichiers source de la documentation sont convertis à latex et après à pdf. Les fichiers latex et pdf de sortie sont stockés dans le dossier ``pathtorepertoryokplm/sphinx-doc/build/latex``.

source: Documentation in French
fr: Documentation en français

source: To compile the user manual in French as html files go to the folder ``pathtorepertoryokplm/sphinx-doc`` and type:
fr: Pour compiler le manuel d'utilisation en français en html allez au dossier ``pathtorepertoryokplm/sphinx-doc`` et tapez :

source: The output html files are saved in the folder ``pathtorepertoryokplm/sphinx-doc/build_fr/html``.
fr: Les fichiers html de sortie sont stockés dans le dossier ``pathtorepertoryokplm/sphinx-doc/build_fr/html``.

source: To compile the pdf documentation, type the following commands:
fr: Pour compiler la documentation en pdf, tapez les commandes suivantes :

source: The source documentation files are converted to latex and then to pdf. The output latex and pdf files are saved in the folder ``pathtorepertoryokplm/sphinx-doc/build_fr/latex``.
fr: Les fichiers source de la documentation sont convertis à latex et après à pdf. Les fichiers latex et pdf de sortie sont sauvegardés dans le dossier ``pathtorepertoryokplm/sphinx-doc/build_fr/latex``.
