Repository: inrae/ALAMODE-okp
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/modules.po
Languages: fr

source: OKP lake model constants.
fr: Constantes du modèle de lacs OKP.

source: This module defines the constants of the equations used to estimate the parameter values of the model OKP as a function of water body characteristics. The constants are defined in Prats & Danis (2019).
fr: Ce module définit les constantes des équations utilisées pour estimer les valeurs des paramètres du modèle OKP en fonction des caractéristiques des plans d'eau. Les constantes sont définies dans Prats & Danis (2019).

source: References
fr: Références

source: Functions to calculate parameter values.
fr: Fonctions pour calculer les valeurs des paramètres.

source: This module contains the definition of the functions used to estimate the value of the parameters used by the OKP lake model. These equations were derived in Prats & Danis (2019).
fr: Ce module contient les définitions des fonctions utilisées pour estimer la valeur des paramètres utilisés par le modèle de lacs OKP. Ces équations ont été obtenues par Prats & Danis (2019).

source: The functions included in this module are:
fr: Les fonctions incluses dans ce module sont :

source: estimate_par_a: estimate parameter A.
fr: estimate_par_a : estime le paramètre A.

source: estimate_par_alpha: estimate parameter alpha.
fr: estimate_par_alpha : estime le paramètre alpha.

source: estimate_par_b: estimate parameter B.
fr: estimate_par_b : estime le paramètre B.

source: estimate_par_beta: estimate parameter beta.
fr: estimate_par_beta : estime le paramètre beta.

source: estimate_par_c: estimate parameter C.
fr: estimate_par_c : estime le paramètre C.

source: estimate_par_e: estimate parameter E.
fr: estimate_par_e : estime le paramètre E.

source: estimate_parameters: estimate OKP parameter values.
fr: estimate_parameters : estime les valeurs des paramètres d'OKP.

source: Estimate the parameter A.
fr: Estime le paramètre A.

source: Parameters
fr: Paramètres

source: a dictionary indicating the value of the independent variables 'latitude' (degrees North), 'altitude' (m) and 'surface' (m\ :sup:`2`\).
fr: un dictionnaire qui indique la valeur des variables indépendantes 'latitude' (dégrées Nord), 'altitude' (m) et 'surface' (m\ :sup:`2`\).

source: a dictionary indicating the value of the parameter constants 'A1' to 'A4'.
fr: un dictionnaire qui indique la valeur des constantes 'A1' à 'A4'.

source: Returns
fr: Retour

source: The estimated value of the parameter *A* according to Eq. (21) in Prats & Danis (2019, p.6).
fr: La valeur estimée du paramètre *A* d'après l'Éq. (21) dans Prats & Danis (2019, p.6).

source: Example
fr: Exemple

source: Estimate the parameter alpha.
fr: Estime le paramètre alpha.

source: a dictionary indicating the value of the independent variables 'altitude' (m), 'surface' (m\ :sup:`2`\), and 'volume' (m\ :sup:`3`\).
fr: un dictionnaire qui indique la valeur des variables indépendantes 'altitude' (m), 'surface' (m\ :sup:`2`\), et 'volume' (m\ :sup:`3`\).

source: a dictionary indicating the value of the parameter constants 'ALPHA1' to 'ALPHA4'.
fr: un dictionnaire qui indique la valeur des constantes 'ALPHA1' à 'ALPHA4'.

source: The estimated value of the parameter :math:`\alpha` according to Eq. (23) in Prats & Danis (2019, p. 6).
fr: La valeur estimée du paramètre :math:`\alpha` d'après l'Éq. (23) dans Prats & Danis (2019, p. 6).

source: Estimate the parameter B.
fr: Estime le paramètre B.

source: a dictionary indicating the value of the independent variable 'zmax' (m).
fr: un dictionnaire qui indique la valeur de la variable indépendante 'zmax' (m).

source: a dictionary indicating the value of the parameter constants 'B1' to 'B2'.
fr: un dictionnaire qui indique la valeur des constantes 'B1' à 'B2'.

source: The estimated value of the parameter *B* according to Eq. (24) in Prats & Danis (2019, p.6).
fr: La valeur estimée du paramètre *B* d'après l'Éq. (24) dans Prats & Danis (2019, p.6).

source: Estimate the parameter beta.
fr: Estime le paramètre beta.

source: value of the parameter E [0 - 1].
fr: valeur du paramètre E [0 - 1].

source: a dictionary indicating the value of the parameter constants 'BETA1' to 'BETA3'.
fr: un dictionnaire qui indique la valeur des constantes 'BETA1' à 'BETA3'.

source: The estimated value of the parameter :math:`\beta` according to Eq. (27) in Prats & Danis (2019, p. 9).
fr: La valeur estimée du paramètre :math:`\beta` d'après l'Éq. (27) dans Prats & Danis (2019, p. 9).

source: Estimate the parameter C.
fr: Estime le paramètre C.

source: a dictionary indicating the value of the independent variable 'altitude' (m).
fr: un dictionnaire qui indique la valeur de la variable indépendante 'altitude' (m).

source: a dictionary indicating the value of the parameter constants 'C1' to 'C2'.
fr: un dictionnaire qui indique la valeur des constantes 'C1' à 'C2'.

source: The estimated value of the parameter *C* according to Eq. (25) in Prats & Danis (2019, p. 6).
fr: La valeur estimée du paramètre *C* d'après l'Éq. (25) dans Prats & Danis (2019, p. 6).

source: Estimate the parameter E.
fr: Estime le paramètre E.

source: a dictionary indicating the value of the independent variables 'surface' (m\ :sup:`2`\) and 'volume' (m\ :sup:`3`\).
fr: un dictionnaire qui indique la valeur des variables indépendantes 'surface' (m\ :sup:`2`\) et 'volume' (m\ :sup:`3`\).

source: a dictionary indicating the value of the parameter constants 'E1' to 'E3'.
fr: un dictionnaire qui indique la valeur des constantes 'E1' à 'E3'.

source: The estimated value of the parameter *E* according to Eq. (28) in Prats & Danis (2019, p. 10).
fr: La valeur estimée du paramètre *E* d'après l'Éq. (28) dans Prats & Danis (2019, p. 10).

source: Estimate the OKP parameter values.
fr: Estime les valeurs des paramètres d'OKP.

source: a dictionary indicating the value of the independent variables 'latitude' (degrees North), 'altitude' (m), 'zmax' (m), 'surface' (m\ :sup:`2`\ ), 'volume' (m\ :sup:`3`\).
fr: un dictionnaire qui indique la valeur des variables indépendantes 'latitude' (dégrées Nord), 'altitude' (m), 'zmax' (m), 'surface' (m\ :sup:`2`\ ), 'volume' (m\ :sup:`3`\).

source: a dictionary indicating the value of the parameter constants 'ALPHA1'-'ALPHA4', 'BETA1'-'BETA3', 'A1'-'A4', 'B1'-'B2', 'C1'-'C2', 'D', 'E1'-'E3'.
fr: un dictionnaire qui indique la valeur des constantes 'ALPHA1'-'ALPHA4', 'BETA1'-'BETA3', 'A1'-'A4', 'B1'-'B2', 'C1'-'C2', 'D', 'E1'-'E3'.

source: A dictionary of the OKP model parameter values according to Eq. (21, 23-25, 27-28) in Prats & Danis (2019, p. 6-10).
fr: Un dictionnaire des valeurs des paramètres du modèle OKP d'après l'Éq. (21, 23-25, 27-28) dans Prats & Danis (2019, p. 6-10).

source: Functions to read and write data.
fr: Fonctions pour lire et écrire des données.

source: The functions in this module are used to read the configuration and input data files of the OKP lake model, as well as for writing the results to a text file.
fr: Les fonctions de ce module servent à lire les fichiers de configuration et d'entrée du modèle de lacs OKP, ainsi qu'à écrire les résultats dans un fichier texte.

source: This module contains the following functions:
fr: Ce module contient les fonctions suivantes :

source: read_dict: read lake or parameter file to dictionary.
fr: read_dict : lit un fichier de lac ou de paramètres dans un dictionnaire.

source: write_dict: write dictionary to file.
fr: write_dict : écrit dictionnaire dans un fichier.

source: Read lake or parameter file to dictionary.
fr: Lit fichier de lac ou de paramètres et stocke dans un dictionnaire.

source: path of text file. The file should be structured in two columns separated by a space; the first column contains key names and the second column contains their values.
fr: chemin du fichier texte. Le fichier devrait être organisé en deux colonnes séparées par un espace ; la première colonne contient les noms des clés et la deuxième colonne contient ses valeurs.

source: A Python dictionary created from the key-value pairs in the text file.
fr: Un dictionnaire Python créé depuis les paires clé-valeur dans le fichier texte.

source: Write dictionary to file.
fr: Écrit dictionnaire à un fichier.

source: a Python dictionary.
fr: un dictionnaire Python.

source: path of the text file to write the data.
fr: chemin du fichier texte où écrire les données.

source: A file located at "path" where the dictionary data is written.
fr: Un fichier situé à "path" où le contenu du dictionnaire data est écrit.

source: Functions for time-related operations.
fr: Fonctions pour opérations temporelles.

source: This module contains functions for time operations (e.g., time averaging or selection of date ranges).
fr: Ce module contient fonctions pour des opérations temporelles (p. ex., calcul de la moyenne sur une période ou sélection de rangs de dates).

source: The included functions are:
fr: Les fonctions incluses sont :

source: daily_f: apply function on daily periods.
fr: daily_f : applique fonction sur des périodes journalières.

source: monthly_f: apply function on monthly periods.
fr: monthly_f : applique fonction sur des périodes mensuelles.

source: select_daterange: return indices between two dates.
fr: select_daterange : retourne les indices entre deux dates.

source: weekly_f: apply function on weekly periods.
fr: weekly_f : applique fonction sur des périodes hebdomadaires.

source: Apply a function using subdaily values as args to obtain daily values.
fr: Applique une fonction à valeurs avec fréquence infra-journalière pour obtenir des valeurs journalières.

source: datetime sequence at subdaily frequency. Missing timestamps are not allowed.
fr: séquence de type datetime à fréquence infra-journalière. Les données manquantes ne sont pas permises.

source: data sequence, the same length of t.
fr: séquence de données de la même longitude que t.

source: the function to be used (sum, numpy.mean, etc.).
fr: la fonction à utiliser (sum, numpy.mean, etc.).

source: A tuple of two sequences/arrays (t_day, y_day). The sequence t_day is a datetime sequence at daily frequency. The sequence y_day is the output data sequence, result of applying funcname to the x values for each day. If the input data for a given day is less than 90% of the measurements for a day, a nan value is returned.
fr: Un tuple de deux séquences/arrays (t_day, y_day). La séquence t_day est une séquence de type datetime à fréquence journalière. La séquence y_day est la séquence des données de sortie, résultat de l'application de funcname aux valeurs x pour chaque jour. Si les données d'entrée disponibles pour un jour sont moins de 90% des mesures possibles pour un jour, une valeur nan est retournée.

source: Apply a function using daily/subdaily values to obtain monthly values.
fr: Applique une fonction à valeurs avec fréquence journalière/infra-journalière pour obtenir des valeurs mensuelles.

source: datetime sequence at daily or subdaily frequency. There should not be missing timestamps.
fr: séquence de type datetime à fréquence journalière ou infra-journalière. Il ne devrait pas y avoir des données manquantes.

source: type of input data, "daily" or "subdaily".
fr: type de données d'entrée, "daily" (journalières) or "subdaily" (infra-journalières).

source: A tuple of two sequences/arrays (t_mon, y_mon). The sequence t_mon is a datetime sequence at monthly frequency. The date indicates the beginning of each month. The sequence y_mon is the output data sequence, result of applying funcname to the x values for each month. If data there are at least 3 days with missing data in a month, a nan value is returned.
fr: Un tuple de deux séquences/arrays (t_mon, y_mon). La séquence t_mon est une séquence de type datetime à fréquence hebdomadaire. La date indique le début de chaque mois. La séquence y_mon est la séquence des données de sortie, résultat de l'application de funcname aux valeurs x pour chaque mois. S'il y a au moins 3 jours avec des données manquantes dans un mois, une valeur nan est retournée.

source: Return indices of dates comprised between two dates.
fr: Retourne les indices des dates comprises entre deux dates.

source: list or array of dates in datetime format.
fr: liste ou array de dates en format datetime.

source: initial date in datetime format.
fr: date initiale en format datetime.

source: last date in datetime format.
fr: date finale en format datetime.

source: An array of indices of dates in t comprised between t_start and t_end (or equal).
fr: Un array des indices des dates dans t comprises entre t_start et t_end (ou égales).

source: Apply a function using daily/subdaily values to obtain weekly values.
fr: Applique une fonction à valeurs avec fréquence journalière/infra-journalière pour obtenir des valeurs hebdomadaires.

source: datetime sequence at daily/subdaily frequency. There should not be missing timestamps.
fr: séquence de type datetime à fréquence journalière ou infra-journalière. Il ne devrait pas y avoir des données manquantes.

source: A tuple of two sequences/arrays (t_week, y_week). The sequence t_week is a datetime sequence at weekly frequency. The date indicates the beginning of each week. The sequence y_week is the output data sequence, result of applying funcname to the x values for each week. If data is not available for all days for a given week, a nan value is returned.
fr: Un tuple de deux séquences/arrays (t_week, y_week). La séquence t_week est une séquence de type datetime à fréquence hebdomadaire. La date indique le début de chaque semaine. La séquence y_week est la séquence des données de sortie, résultat de l'application de funcname aux valeurs x pour chaque semaine. S'il n'y a pas de données disponibles pour tous les jours d'une semaine, une valeur nan est retournée.

source: OKP lake model functions.
fr: Fonctions du modèle de lacs OKP.

source: This module contains the functions used to calculate epilimnion and hypolimnion temperature corresponding to the OKP model, described in Prats & Danis (2019).
fr: Ce module contient les fonctions utilisées pour calculer la température de l'épilimnion et de l'hypolimnion d'après le modèle OKP, décrit dans Prats & Danis (2019).

source: calc_epilimnion_temperature: calculate epilimnion temperature.
fr: calc_epilimnion_temperature : calcule la température de l'épilimnion.

source: calc_hypolimnion_temperature: calculate hypolimnion temperature.
fr: calc_hypolimnion_temperature : calcule la température de l'hypolimnion.

source: fit_sinusoidal: fit a sinusoidal function.
fr: fit_sinusoidal : cale une fonction sinusoïdale.

source: main: parse command line arguments and run the OKP model.
fr: main : analyse les arguments en ligne de commande et exécute le modèle OKP.

source: run_okp: run the OKP model.
fr: run_okp : exécute le modèle OKP.

source: water_density: calculate water density.
fr: water_density : calcule la densité de l'eau.

source: Calculate epilimnion temperature.
fr: Calcule la température de l'épilimnion.

source: daily air temperature (ºC).
fr: température de l'air journalière (ºC).

source: daily solar radiation (W/m\ :sup:`2`\ ).
fr: rayonnement solaire journalier (W/m\ :sup:`2`\ ).

source: periodicity of the input meteorological data and of the simulation; it can take the values 'daily', 'weekly', 'monthly'.
fr: fréquence des données météorologiques d'entrée et de la simulation ; les valeurs possibles sont 'daily' (journalière), 'weekly' (hebdomadaire), 'monthly' (mensuelle).

source: The daily simulated epilimnion temperature in degrees C.
fr: La température simulée de l'épilimnion en dégrées C.

source: Calculate hypolimnion temperature.
fr: Calcule la température de l'hypolimnion.

source: daily epilimnion temperature (ºC).
fr: température de l'épilimnion journalière (ºC).

source: a dictionary with values for the parameters BETA, A, D and E.
fr: un dictionnaire avec valeurs des paramètres BETA, A, D et E.

source: periodicity of the input epilimnion temperature data and of the simulation; it can take the values 'daily', 'weekly', 'monthly'.
fr: fréquence des données d'entrée de la température de l'épilimnion et de la simulation ; les valeurs possibles sont 'daily' (journalière), 'weekly' (hebdomadaire), 'monthly' (mensuelle).

source: The daily simulated hypolimnion temperature in ºC.
fr: La température simulée de l'hypolimnion en ºC.

source: Fit a sinusoidal function to data.
fr: Cale une fonction sinusoïdale aux données.

source: This function fits a sinusoidal function of the form:
fr: Cette fonction cale une fonction sinusoïdale du type :

source: array of time data.
fr: array de données de temps.

source: array of response data.
fr: array de données de réponse.

source: length of the period in time units.
fr: longueur de la période en unités de temps.

source: A tuple (m, a, ph) of the three coefficients of a sinusoidal function providing the mean value (m), the amplitude of the sinusoidal function (a), and the phase of the sinusoidal function (ph).
fr: Un tuple (m, a, ph) des trois coefficients d'une fonction sinusoïdale donnant la valeur moyenne (m), l'amplitude de la fonction sinusoïdale (a), et la phase de la fonction sinusoïdale (ph).

source: Parse command line arguments and run the OKP model.
fr: Analyse les arguments en ligne de commande arguments et exécute le modèle OKP.

source: To obtain help on this function type "run_okp -h" in the command line.
fr: Pour obtenir aide sur cette fonction tapez "run_okp -h" en ligne de commande.

source: Run the OKP model.
fr: Exécute le modèle OKP.

source: path of the output file.
fr: chemin du fichier de sortie.

source: path of the meteorological data file.
fr: chemin du fichier de données météorologiques.

source: path of the parameter file.
fr: chemin du fichier de paramètres.

source: path of the lake data file (optional, it is only necessary if par_file is not provided).
fr: chemin fichier de données de lac (optionnel, seulement nécessaire si par_file n'est pas muni).

source: date of start of the simulation in the format 'YYYY-mm-dd'.
fr: date de début de la simulation avec le format 'AAAA-mm-jj'.

source: date of end of the simulation in the format 'YYYY-mm-dd'.
fr: date de finalisation de la simulation avec le format 'AAAA-mm-jj'.

source: periodicity of the output data (only implemented for daily simulations); it can take the values 'daily', 'weekly', 'monthly'. It is only used if the periodicity of the simulations is 'daily'.
fr: fréquence des données de sortie (implémentée seulement pour simulations journalières) ; les valeurs possibles sont 'daily' (journalière), 'weekly' (hebdomadaire), 'monthly' (mensuelle). Utilisée seulement si la fréquence des simulations est 'daily'.

source: path of the file containing observational data to calculate error statistics. If validation_data_file is defined, you need to define also validation_res_file. If None, error statistics are not calculated. Validation is only implemented for 'daily' simulations.
fr: chemin du fichier contenant données observées pour calculer les statistiques d'erreur. Si validation_data_file est défini, il faut définir aussi validation_res_file. Si c'est None, les statistiques d'erreur ne sont pas calculées. La validation est implémentée uniquement pour simulations journalières.

source: path of the file where validation results will be written. It requires the definition of a valid validation_data_file.
fr: chemin du fichier où écrire les résultats de la validation. Il nécessite la définition d'un fichier validation_data_file valide.

source: A text file named output_file is written. If the par_file does not exist, it is also created by this function. If validation data is provided, the file validation_res_file containing information on error statistics is created too.
fr: Un fichier texte nommé output_file est écrit. Si par_file n'existe pas, il est créé aussi par cette fonction. Si des données de validation sont fournies, le fichier validation_res_file contenant information sur les statistiques d'erreur est créé aussi.

source: Calculate the water density as a function of temperature.
fr: Calcule la densité de l'eau en fonction de la température.

source: water temperature (ºC).
fr: température de l'eau (ºC).

source: The water density (kg/m\ :sup:`3`\ ) calculated using the formula by Markofsky & Harleman (1971).
fr: La densité de l'eau (kg/m\ :sup:`3`\ ) est calculée avec la formule de Markofsky & Harleman (1971).

source: Functions for the validation of simulation results.
fr: Fonctions la validation des résultats des simulations.

source: This module contains only one function, used to validate simulation results:
fr: Ce module contient uniquement une fonction, utilisée pour valider les résultats de simulation :

source: error_statistics: calculate error statistics.
fr: error_statistics : calcule statistiques d'erreur.

source: Calculate error statistics.
fr: Calcule statistiques d'erreur.

source: time array of the simulated data.
fr: array de temps des données simulées.

source: array with simulated values.
fr: array avec des valeurs simulées.

source: time array of observed data.
fr: array de temps des données observées.

source: observed values.
fr: valeurs observées.

source: A tuple of six performance indicators (n, sd, r, me, mae, rmse), corresponding to the number of measurements (n), the standard deviation (sd), the correlation coefficient (r), the mean error (me), the mean absolute error (mae), and the root mean square error (rmse).
fr: Un tuple de six indicateurs de performance (n, sd, r, me, mae, rmse), correspondant au nombre de mesures (n), la déviation standard (sd), le coefficient de corrélation (r), l'erreur moyenne (me), l'erreur absolue moyenne (mae), et la racine carrée de l'erreur quadratique moyenne (rmse).
