Repository: inrae/ALAMODE-okp
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/usage.po
Languages: fr

source: Usage
fr: Utilisation

source: Input data
fr: Données d'entrée

source: The model reads input and configuration data from three text files, one obligatory (``meteo_file``) and two optional (``lake_file`` and ``par_file``). Field data used for validation may also be read from a text file (``validation_data_file``). Once you have created the input files, you can use the ``okplm`` package as a command line application or a Python module.
fr: Le modèle lit les données d'entrée et de configuration depuis trois fichiers texte, un obligatoire (``meteo_file``) et deux optionnels (``lake_file`` et ``par_file``). Les données de terrain utilisées pour la validation peuvent être lues depuis un fichier texte (``validation_data_file``). Une fois vous avez créé les fichiers d'entrée, vous pouvez utiliser le paquet ``okplm`` comme une application en ligne de commande ou un module Python.

source: File ``meteo_file``
fr: Fichier ``meteo_file``

source: Obligatory input file. It contains air temperature and solar radiation data.
fr: Fichier d'entrée obligatoire. Il contient données de température de l'air et rayonnement solaire.

source: The file is structured in three columns separated by white spaces:
fr: Le fichier est organisé en trois colonnes séparées par espaces vides :

source: date: date in the format 'yyyy-mm-dd'.
fr: date : date avec le format 'aaaa-mm-jj'.

source: tair: mean daily air temperature (ºC).
fr: tair : température de l'air journalière moyenne (ºC).

source: sr: mean daily solar radiation (W m\ :sup:`-2`\ ).
fr: sr : rayonnement solaire journalier moyen (W/m\ :sup:`2`\ ).

source: Meteorological data may be provided at three different frequencies: daily, weekly and monthly.
fr: Il est possible de munir les données météorologiques avec trois fréquences différentes : journalière, hebdomadaire et mensuelle.

source: File ``lake_file``
fr: Fichier ``lake_file``

source: Optional input file. It contains lake characteristics (depth, surface, volume, altitude, latitude).
fr: Fichier d'entrée optionnel. Il contient les caractéristiques du lac (profondeur, surface, volume, altitude, latitude).

source: The file is structured in two columns, separated by blanks. The first column contains the names of the variables and the second one contains their values. The variable names are:
fr: Le fichier est organisé en deux colonnes, séparées par espaces. La première colonne contient les noms des variables et la deuxième contient leurs valeurs. Le noms des variables sont :

source: name: lake name or code (optional, to identify the lake)
fr: name : nom ou code du lac (optionnel, pour identifier le lac)

source: zmax: lake depth (m)
fr: zmax : profondeur du lac (m)

source: surface: lake surface area (m\ :sup:`2`\ )
fr: surface : aire de surface du lac (m\ :sup:`2`\ )

source: volume: lake volume (m\ :sup:`3`\ )
fr: volume : volume du lac (m\ :sup:`3`\ )

source: altitude: altitude above sea level (m)
fr: altitude : altitude sur le niveau de la mer (m)

source: type: lake type; it can be 'L' for lakes (surface outlet) or 'R' for reservoirs (submerged outlet)
fr: type : type de lac ; il peut être 'L' pour les lacs (exutoire en surface) ou 'R' pour les réservoirs (exutoire submergé)

source: The pairs of names-values may be specified in any order.
fr: Les paires de noms-valeurs peuvent être spécifiés dans n'importe quel ordre.

source: For example, for the Lake Allos (ALL04)::
fr: Par exemple, pour le Lac d'Allos (ALL04)::

source: Providing either ``lake_file`` or ``par_file`` is necessary. If the ``par_file`` is given, the program uses parameter values in ``par_file``. Otherwise, the ``lake_file`` is required and the program calculates the model parameters from the lake characteristics included in the ``lake_file``.
fr: Il est nécessaire de fournir soit ``lake_file`` soit ``par_file``. Si ``par_file`` est donné, le programme utilise les valeurs des paramètres dans ``par_file``. En cas contraire, il faut donner ``lake_file`` et le programme calcule les paramètres du modèle depuis les caractéristiques du lac spécifiées dans ``lake_file``.

source: File ``par_file``
fr: Fichier ``par_file``

source: Optional input file. It contains the value of the model parameters.
fr: Fichier d'entrée optionnel. Il contient la valeur des paramètres du modèle.

source: The file is structured in two columns, separated by blanks. The first column contains the names of the parameters and the second one contains their values. The parameter names are:
fr: Le fichier est organisé en deux colonnes, séparées par espaces. La première colonne contient les noms des paramètres et la deuxième contient leurs valeurs. Les noms des paramètres sont :

source: A: parameter *A*. It corresponds to the mean annual epilimnion temperature (ºC).
fr: A : paramètre *A*. Il correspond à la température moyenne annuelle de l'épilimnion (ºC).

source: B: parameter *B*. It modulates the effect of air temperature.
fr: B : paramètre *B*. Il module l'effet de la température de l'air.

source: C: parameter *C*. It modulates the effect of solar radiation.
fr: C : paramètre *C*. Il module l'effet du rayonnement solaire.

source: D: parameter *D*. A constant value of 0.51 by default.
fr: D : paramètre *D*. Une valeur constante de 0.51 par défaut.

source: E: parameter *E*. It is related to the ratio between hypolimnion temperature and epilimnion temperature. It is equal to one when the water body is not stratified.
fr: E : paramètre *E*. Il a relation avec le ratio entre la température de l'hypolimnion et la température de l'épilimnion. Il est égal à un quand le plan d'eau n'est pas stratifié.

source: ALPHA: parameter \ :math:`\alpha`\ , exponential smoothing factor of the air temperature.
fr: ALPHA : paramètre \ :math:`\alpha`\ , facteur de lissage exponentiel de la température de l'air.

source: BETA: parameter \ :math:`\beta`\ , exponential smoothing factor of the epilimnion temperature.
fr: BETA : paramètre \ :math:`\beta`\ , facteur de lissage exponentiel de la température de l'épilimnion.

source: mat: mean annual air temperature (ºC).
fr: mat : température moyenne annuelle de l'air (ºC).

source: at_factor: multiplicative factor of air temperature.
fr: at_factor: facteur multiplicatif de la température de l'air

source: sw_factor: multiplicative factor of shortwave radiation.
fr: sw_factor: facteur multiplicatif du rayonnement solaire.

source: For the definition of the parameters and further information see Prats & Danis (2019).
fr: Pour la définition des paramètres et plus d'information voyez Prats & Danis (2019).

source: If ``par_file`` is not given by the user, the model calculates the parameter values as a function of the lake characteristics defined in ``lake_file`` according to the parameterisation by Prats & Danis (2019) for French freshwater bodies. The values of the parameters thus estimated are written to ``par_file``.
fr: Si ``par_file`` n'est pas donnée par l'utilisateur, le modèle calcule les valeurs des paramètres en fonction des caractéristiques du lac définies dans ``lake_file`` d'accord avec la paramétrisation de Prats & Danis (2019) pour les plans d'eau douce français. Les valeurs des paramètres ainsi estimés sont écrits dans ``par_file``.

source: The parameters ``at_factor`` and ``sw_factor`` are multiplicative factors of input meteorological data, that can be useful for sensitivity analyses. By default they take a value of 1.0.
fr: The parameters ``at_factor`` and ``sw_factor`` are multiplicative factors of input meteorological data, that can be useful for sensitivity analyses. Par défaut ils prennent une valeur de 1.0.

source: File ``validation_data_file``
fr: Fichier ``validation_data_file``

source: Optional observational data file used for the calculation of performance indicators.
fr: Fichier de données observées optionnel utilisé pour calculer indicateurs de performance.

source: The file is structured in (at most) three columns separated by white spaces:
fr: Le fichier est organisé en (au maximum) trois colonnes séparées par espaces vides :

source: tepi: epilimnion temperature (ºC) (optional).
fr: tepi : température de l'épilimnion (ºC) (optionnelle).

source: thyp: hypolimnion temperature (ºC) (optional).
fr: thyp : température de l'hypolimnion (ºC) (optionnelle).

source: The file contains data for the dates for which measurements are available. You may provide data for only one of tepi or thyp::
fr: Le fichier contient données pour les dates où il y a des mesures disponibles. Vous pouvez fournier des données seulement pour une d'entre tepi et thyp::

source: Start and end of simulation
fr: Début et fin de la simulation

source: When calling the function ``run_okp()``, you can specify the dates of start and end of the simulation by using the arguments ``start_date`` and ``end_date`` (or ``-s`` and ``-e`` in the command line). The format of the dates is 'yyyy-mm-dd'.
fr: Quand vous appelez la fonction ``run_okp()``, vous pouvez spécifier les dates de début et fin de simulation avec les arguments ``start_date`` et ``end_date`` (ou ``-s`` et ``-e`` en ligne de commande). Le format des dates est 'aaaa-mm-jj'.

source: If no start and end date are defined, the length of the simulation is determined by the length of the ``meteo_file``.
fr: Si la date de début et fin ne sont pas définies, la durée de la simulation est déterminée par la longueur de ``meteo_file``.

source: Command line application
fr: Application en ligne de commande

source: To run ``okplm`` in the command line, change to the directory containing the input files and make:
fr: Pour exécuter ``okplm`` en ligne de commande, changez au dossier qui contient les fichiers d'entrée et faites :

source: Alternatively, you can indicate the input data folder. E.g.:
fr: Alternativement, vous pouvez indiquer le dossier des données d'entrée. P. ex.:

source: Please note that the software understands the tilde '~' expansion, so that you may use instead:
fr: Veuillez noter que le logiciel comprends le remplacement du tilde '~', de façon que vous pouvez utiliser aussi :

source: By default, the model looks for the files named ``meteo.txt`` (meteorological data), ``lake.txt`` (lake data) and ``par.txt`` (values of the model parameters). You can specify other names using the optional arguments ``-m``, ``-l`` and ``-p``, respectively. E.g.,
fr: Par défaut, le modèle cherche les fichiers nommés ``meteo.txt`` (données météorologiques), ``lake.txt`` (données du lac) et ``par.txt`` (valeurs des paramètres du modèle). Vous pouvez spécifier d'autres noms de fichier avec les arguments optionnels ``-m``, ``-l`` et ``-p``, respectivement. P. ex.,

source: Similarly, the results are written by default to ``output.txt``, but you can use define another name using ``-o``.
fr: De façon similaire, les résultats sont écrit par défaut dans ``output.txt``, mais vous pouvez définir un autre nom avec ``-o``.

source: You can limit the length of the simulation by specifying the start and end dates:
fr: Vous pouvez limiter la durée de la simulation spécifiant les dates de début et fin :

source: To tell the model the frequency of the input meteorological data and of the simulation you may use ``-d`` (daily), ``-w`` (weekly) or ``-n`` (monthly). E.g.
fr: Pour communiquer au modèle quelle est la fréquence des données météorologiques d'entrée et de la simulation vous pouvez utiliser ``-d`` (journalière), ``-w`` (hebdomadaire) or ``-n`` (mensuelle). P. ex.

source: By default the program assumes the input data is provided at a daily time step.
fr: Par défaut le logiciel présume que les données d'entrée sont données à un pas de temps journalier.

source: For daily simulations, the output can be given at daily, weekly of monthly frequencies with the arguments ``--daily_output``, ``--weekly_output`` and ``--monthly_output``.
fr: Pour simulations journalières, la sortie peut être donnée à fréquence journalière, hebdomadaire ou mensuelle avec les arguments ``--daily_output``, ``--weekly_output`` et ``--monthly_output``.

source: It is also possible to obtain error statistics of the daily simulations by providing an observation data file (e.g., ``obs.txt``) and the name of the validation results file (e.g., ``err_stats.txt``):
fr: Il est possible aussi d'obtenir statistiques d'erreur des simulations journalières si on fournit un fichier de données observées (p. ex., ``obs.txt``) et le nom du fichier des résultats de validation (p. ex., ``err_stats.txt``) :

source: If these file names are not provided, validation statistics are not calculated.
fr: Si ces noms de fichier ne sont pas données, les statistiques de validation ne sont pas calculées.

source: For obtaining help on the usage of the application, write:
fr: Pour avoir une aide sur l'utilisation de l'application, écrivez :

source: Python module
fr: Module Python

source: To use ``okplm`` as a Python module you can simply import it and use the functions within::
fr: Pour utiliser ``okplm`` comme un module Python vous pouvez simplement l'importer et utiliser les fonctions qu'il contient::

source: To run the model, first define the names of the different input and output files. For example::
fr: Pour exécuter le modèle, d'abord définissez les noms des différents fichiers d'entrée et de sortie. Par exemple::

source: Remember you may use the tilde '~' expansion.
fr: À nouveau, vous pouvez utiliser le tilde '~'.

source: Then, type::
fr: Après, tapez::

source: You may also define a start, an end date and a periodicity for the simulations::
fr: Vous pouvez aussi définir le début, la date de fin et la périodicité des simulations::

source: The output of daily simulations can be given at ``daily``, ``weekly`` or ``monthly`` frequency using the argument ``output_periodicity``.
fr: La sortie des simulations journalières peut être donnée à fréquence journalière (``daily``), hebdomadaire (``weekly``) ou mensuelle (``monthly``) avec l'argument ``output_periodicity``.

source: If you provide a file containing observational data (``validation_data_file``) and a file name where to write the validation results (``validation_res_file``), error statistics are calculated and written to the specified file.
fr: Si vous fournissez un fichier contenant données observées (``validation_data_file``) et le nom d'un fichier où écrire les résultats de validation (``validation_res_file``), les statistiques d'erreur sont calculées et écrites dans le fichier spécifié.

source: Other useful functions are ``okplm.read_dict()`` and ``okplm.write_dict()``, which can be used to read and write the lake data and parameter files.
fr: D'autres fonctions utiles sont ``okplm.read_dict()`` et ``okplm.write_dict()``, qui peuvent être utilisées pour lire et écrire les fichiers de lac et des paramètres.

source: You can include the previous commands in a Python script (see the example script ``test_script.py``). To run a python script from the command line, type:
fr: Vous pouvez inclure les commandes précédentes dans un script Python (voyez le script d'exemple ``test_script.py``). Pour exécuter un script python script en ligne de commande, tapez :

source: Output data
fr: Données de sortie

source: The OKP model produces three types of output data:
fr: Le modèle OKP produit trois types de données de sortie :

source: water temperature simulations, saved to the file ``output_file``.
fr: simulations de température de l'eau, sauvegardées au fichier ``output_file``.

source: estimated parameter values (if not provided by the user), saved to the file ``par_file`` described above.
fr: valeurs estimées des paramètres (si non fournies par utilisateur), sauvegardées au fichier ``par_file`` décrit ci-dessus.

source: indicators of simulation performance (if validation data is provided), saved to the file ``validation_res_file``.
fr: indicateurs de la performance des simulations (s'il y a des données de validation), sauvegardés dans le fichier ``validation_res_file``.

source: File ``output_file``
fr: Fichier ``output_file``

source: Main output file. It contains the simulated epilimnion and hypolimnion temperature at the requested output periodicity.
fr: Fichier de sortie principale. Il contient la température simulée de l'épilimnion et de l'hypolimnion avec la périodicité de sortie sollicitée.

source: tepi: epilimnion temperature (ºC).
fr: tepi : température de l'épilimnion (ºC).

source: thyp: hypolimnion temperature (ºC).
fr: thyp : température de l'hypolimnion (ºC).

source: File ``validation_res_file``
fr: Fichier ``validation_res_file``

source: Optional output file. It contains performance statistics of the simulation, calculated if ``validation_data_file`` and ``validation_res_file`` are defined.
fr: Fichier de sortie optionnel. Il contient statistiques de la simulation, calculées si ``validation_data_file`` et ``validation_res_file`` sont définis.

source: The file is structured in six columns separated by white spaces:
fr: Le fichier est organisé en six colonnes séparées par espaces vides :

source: n: number of measurements.
fr: n : nombre de mesures.

source: sd: standard deviation.
fr: sd : déviation standard.

source: r: correlation coefficient.
fr: r : coefficient de corrélation.

source: me: mean error.
fr: me : erreur moyenne.

source: mae: mean absolute error.
fr: mae : erreur absolue moyenne.

source: rmse: root mean square error.
fr: rmse : racine carrée de l'erreur quadratique moyenne.

source: The first line of results corresponds to the epilimnion, and the second line of results corresponds to the hypolimnion.
fr: La première ligne des résultats correspond à l'épilimnion, et la deuxième ligne des résultats correspond à l'hypolimnion.
